# Zone Calculated Cooling Load Property

Source: https://www.revitapidocs.com/2026/6ae85609-7bff-d53b-1333-3eb588c2a892.htm

---

| Zone Calculated Cooling Load Property |
| --- |

**Note: This API is now obsolete.**

Get the Calculated Cooling Load of the Zone.
**Namespace:** Autodesk.Revit.DB.Mechanical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone and SystemZoneData objects instead.")]
public double CalculatedCoolingLoad { get; }
```

```
<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone and SystemZoneData objects instead.")>
Public ReadOnly Property CalculatedCoolingLoad As Double
	Get
```

```
public:
[ObsoleteAttribute(L"This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone and SystemZoneData objects instead.")]
property double CalculatedCoolingLoad {
	double get ();
}
```

```
[<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone and SystemZoneData objects instead.")>]
member CalculatedCoolingLoad : float with get
```

#### Property Value

Double Remarks This property is used to get the Calculated Cooling Load of the Zone. See Also

#### Reference

Zone Class Autodesk.Revit.DB.Mechanical Namespace